In [1]:
import sqlite3
conn = sqlite3.connect('../example.db')
cursor = conn.cursor()

### SELECT with WHERE clause

In [2]:
cursor.execute("SELECT * FROM EMPLOYEE").fetchall()

[('Ramya', 'Rama Priya', 27, 'F', 9000.0, 'I like what I do'),
 ('Kolapo', 'Joshua', 40, 'M', 7000.0, 'I am a singer'),
 ('Sarmista', 'Sharma', 26, 'F', 10000.0, 'I was made in the moon')]

In [3]:
sql = '''
    SELECT FIRST_NAME FROM EMPLOYEE WHERE INCOME <= 7500 AND SEX = 'M'
'''

In [4]:
cursor.execute(sql)
conn.commit()

result1 = cursor.fetchall()
print(result1)

[('Kolapo',)]

In [5]:
sql2 = '''
    SELECT BIO FROM EMPLOYEE
    WHERE AGE < 25
'''

In [6]:
cursor.execute(sql2)
conn.commit()

result2 = cursor.fetchall()
print(result2)

[]

**OR and AND**

In [7]:
sql2 = '''
    SELECT BIO FROM EMPLOYEE
    WHERE AGE < 25 OR SEX = 'F'
'''

In [8]:
cursor.execute(sql2)
conn.commit()

result2 = cursor.fetchall()
print(result2)

[('I like what I do',), ('I was made in the moon',)]

**LIKE**

In [9]:
sql2 = '''
    SELECT BIO FROM EMPLOYEE
    WHERE BIO LIKE '%am%'
'''

In [10]:
cursor.execute(sql2)
conn.commit()

result2 = cursor.fetchall()
print(result2)

[('I am a singer',)]

**BETWEEN**

In [11]:
sql2 = '''
    SELECT * FROM EMPLOYEE
    WHERE AGE BETWEEN 20 AND 25
'''

In [12]:
cursor.execute(sql2)
conn.commit()

result2 = cursor.fetchall()
print(result2)

[]

### ORDERBY

In [13]:
sql3 = '''
    SELECT * FROM EMPLOYEE
    WHERE SEX = 'M' 
    ORDER BY INCOME ASC
'''

In [14]:
cursor.execute(sql3)
conn.commit()

result3 = cursor.fetchall()
print(result3)

[('Kolapo', 'Joshua', 40, 'M', 7000.0, 'I am a singer')]

### UPDATE TABLE

In [15]:
sql4 = '''
    UPDATE EMPLOYEE SET BIO ='I am no longer ajanlekoko'
    WHERE FIRST_NAME = 'Vinay';
'''

In [16]:
cursor.execute(sql4)
conn.commit()

In [17]:
cursor.execute('''SELECT * FROM EMPLOYEE''')
conn.commit()

result4 = cursor.fetchall()
print(result4)

[('Ramya', 'Rama Priya', 27, 'F', 9000.0, 'I like what I do'), ('Kolapo', 'Joshua', 40, 'M', 7000.0, 'I am a singer'), ('Sarmista', 'Sharma', 26, 'F', 10000.0, 'I was made in the moon')]

### DELETE RECORD

In [18]:
sql5 = '''
    DELETE FROM EMPLOYEE
    WHERE AGE < 26
'''

In [19]:
cursor.execute(sql5)
conn.commit()

In [20]:
cursor.execute('''SELECT * FROM EMPLOYEE''')
conn.commit()

result5 = cursor.fetchall()
print(result5)

[('Ramya', 'Rama Priya', 27, 'F', 9000.0, 'I like what I do'), ('Kolapo', 'Joshua', 40, 'M', 7000.0, 'I am a singer'), ('Sarmista', 'Sharma', 26, 'F', 10000.0, 'I was made in the moon')]

### DROP TABLE

In [21]:
cursor.execute("CREATE TABLE STAFF(NAME CHAR(20))")
conn.commit()

In [22]:
cursor.execute("""SELECT name FROM sqlite_master 
    WHERE type='table';""")

conn.commit()

result6 = cursor.fetchall()
print(result6)

[('EMPLOYEE',), ('STAFF',)]

In [23]:
cursor.execute("DROP TABLE STAFF")
conn.commit()

In [24]:
cursor.execute("""SELECT name FROM sqlite_master 
    WHERE type='table';""")

conn.commit()

result7 = cursor.fetchall()
print(result7)

[('EMPLOYEE',)]